In [1]:
import pandas as pd

In [2]:
# 1A:
# A pandas series is like a column in a table.
# It is a one dimensional array holding data of any data type.

my_data = [4,8,15,16,23,42]
my_series = pd.Series(my_data)

In [3]:
my_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
my_series[0]

4

In [ ]:
# 2A:
my_list_of_10_ele = [1,2,3,4,5,6,7,8,9,10]
my_series_2 = pd.Series(my_list_of_10_ele)
my_series_2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [7]:
# 3A:
# Creating a data frame
my_dict={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']

}
df1 = pd.DataFrame(my_dict)

In [8]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
# 4A:
# Dataframe in pandas is a two-dimensional data structure, like a 2-D array or a table with rows and colums.
# Whereas Series in pandas is a one-dimentsional data structure, like a 1-D array of any data type or a column in a table
new_series = pd.Series(['apple','ball','cat'])
new_data_frame = pd.DataFrame({'Name':['Alice','Bob','Charlie'],'Course':['Datascience','web','app']})

In [ ]:
new_data_frame

      Name       Course
0    Alice  Datascience
1      Bob          web
2  Charlie          app

In [11]:
new_series

0    apple
1     ball
2      cat
dtype: object

In [15]:
# 5A:
# Few manipulations on the above data frame, which we created just now in the above cell
new_data_frame.head()

      Name       Course
0    Alice  Datascience
1      Bob          web
2  Charlie          app

In [17]:
new_data_frame.drop('Course',axis=1)

      Name
0    Alice
1      Bob
2  Charlie

In [19]:
new_data_frame.drop(2,axis=0)

    Name       Course
0  Alice  Datascience
1    Bob          web

In [20]:
# This is how we manipulate data according to our requirements, here are jsut use case of them.

6A:
Series: Value-mutable but not size-mutable.You can change the values within a Series, but you cannot add or remove elements.
Data-frame: Both value-mutable and size-mutable. You can change the values within a dataframe, and you can also add or remove rows and columns.
Panel: Deprecated in favor of using MultiIndex DataFrames.

In [21]:
# 7A:
series_1 = [i for i in range(5)]
series_2 = [i**2 for i in range(5)]
series_3 = [i**3 for i in range(5)]
df2 = pd.DataFrame({'Numbers':series_1,'Numbers_Squares':series_2,'Numbers_Cubes':series_3})

In [22]:
df2

   Numbers  Numbers_Squares  Numbers_Cubes
0        0                0              0
1        1                1              1
2        2                4              8
3        3                9             27
4        4               16             64